OFtutorialTest01_cvd/cvd/0/T
/*--------------------------------*- Python -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://xxxxxxx
    \\  /    A nd           | Version:  xx
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
   format     ascii;
   class       volScalarField;
   location        "0";
   object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions     [0 0 0 1 0 0 0];

internalField      nonuniform List<scalar>
2550
(
300.0
300.0
300.0
300.0
300.0
300.0
300.0
300.0
...
)
;

boundaryField
{
   INLET
    {
       type    Specified;
       value   uniform (300);
    }
   OUTLET
    {
       type    Outlet;
       value   uniform (0);
    }
   WALL1
    {
       type    Zero Flux;
       value   uniform (0);
    }
   WALL2
    {
       type    Zero Flux;
       value   uniform (0);
    }
   SYS1
    {
       type    Empty;
       value   uniform (0);
    }
   SYS2
    {
       type    Empty;
       value   uniform (0);
    }
   SYS3
    {
       type    Empty;
       value   uniform (0);
    }
   BOTTOM
    {
       type    Specified;
       value   uniform (1000);
    }
}

// ************************************************************************* //
